#include"Fault.h"

//------------------------------------------------------------------------
//スタック
//------------------------------------------------------------------------
typedef struct stack {
	int max_num;	//最大要素数
	int ptr;		//ポインタ
	NLIST** stk;	//スタック
}STACK;

//------------------------------------------------------------------------
//キュー
//------------------------------------------------------------------------
typedef struct queue {
	int max;		//最大要素数
	int num;		//要素数
	int front;		//先頭インデックス
	int rear;		//末尾インデックス
	NLIST** que;	//キュー
}QUE;