//------------------------------------------------------------------------
//インクルード
//------------------------------------------------------------------------
#include <stdio.h>
#include <time.h>
#include<stdlib.h>
#include<string.h>

//------------------------------------------------------------------------
//自作インクルード
//------------------------------------------------------------------------
#include"../../Header/Define.h"

//=========================================================================
//  関数名 : logic_sim
//  機  能 : 論理シミュレーション
//　戻り値：int 正常終了:SUCCESS 異常終了:ERROR
//　引数：void
//=========================================================================
int logic_sim(void) {

	//テストベクトル挿入
	test_v_read();

	//1時刻目の論理シミュレーション
	if (logic_sim_1time() != SUCCESS) {
		printf("【ERROR】:Logic Simulation 1 time(logic_sim.c)\n");
		exit(1);
	}

	//1時刻目と2時刻目の信号線値挿入
	ppo_ppi_cat();

	//2時刻目の論理シミュレーション
	if (logic_sim_2time() != SUCCESS) {
		printf("【ERROR】:Logic Simulation 2 time(logic_sim.c)\n");
		exit(1);
	}

	return SUCCESS;
}