//------------------------------------------------------------------------
//インクルード
//------------------------------------------------------------------------
#include <stdio.h>
#include <time.h>
#include<stdlib.h>
#include<string.h>

//------------------------------------------------------------------------
//自作インクルード
//------------------------------------------------------------------------
#include"../../Header/Define.h"

//=========================================================================
//  関数名 : ppo_ppi_cat
//  機  能 : ppoとppiの連結
//　戻り値：int 正常終了:SUCCESS 異常終了:ERROR
//　引数：void
//=========================================================================
int ppo_ppi_cat(void) {
	int i;

	//外部入力は固定
	for (i = 0; i < n_pi; i++) {
		pi[i]->val_2t = pi[i]->val_1t;
	}

	//疑似外部入力は1時刻前の疑似外部出力
	for (i = 0; i < n_ppo; i++) {
		ppi[i]->val_2t = ppi[i]->in[0]->val_1t;
	}

	return SUCCESS;
}