//------------------------------------------------------------------------
//インクルード
//------------------------------------------------------------------------
#include <stdio.h>
#include <time.h>
#include<stdlib.h>
#include<string.h>

//------------------------------------------------------------------------
//自作インクルード
//------------------------------------------------------------------------
#include"../../Header/Define.h"

//=========================================================================
//  関数名 : mini_cloc_pbo_size
//  機  能 : PBOのサイズを計算
//  戻り値 : なし
//  引  数 : なし
//=========================================================================
PBO mini_calc_pbo_size(void) {

	PBO pbo;
	pbo.val = 0;
	pbo.h_constraint = 0;
	pbo.s_constraint = 0;
	pbo.lit = 0;

	suffix = n_net * 2 + 1;

	//---------------------------------------------
	//制約数計算
	//---------------------------------------------
	pbo.h_constraint = mini_calc_hard_constraint();		//ハード制約(正常回路用)

	//---------------------------------------------
	//変数計算
	//---------------------------------------------
	pbo.val = suffix + pbo.s_constraint - 1;

	return pbo;

}


//=========================================================================
//  関数名 : mini_calc_hard_constraint
//  機  能 : 制約数計算(ハード)
//  戻り値 : なし
//  引  数 : なし
//=========================================================================
int mini_calc_hard_constraint(void) {

	unsigned int n = 0;

	//---------------------------------------------
	//正常回路
	//---------------------------------------------
	for (int i = 0; i < n_net; i++) {
		switch (nl[i].type) {
		case AND:
			n += nl[i].n_in + 1;
			break;
		case NAND:
			n += nl[i].n_in + 1;
			break;
		case OR:
			n += nl[i].n_in + 1;
			break;
		case NOR:
			n += nl[i].n_in + 1;
			break;
		case INV:
			n += 2;
			break;
		case FOUT:
			n += 2;
			break;
		case BUF:
			n += 2;
			break;
		case EXOR:
			n += 4;
			break;
		}
	}
	n = n * 2;	//2時刻目

	//---------------------------------------------
	//1時刻目と2時刻目のFFを接続するDFF
	//---------------------------------------------
	n = n + 2 * n_dff;

	//---------------------------------------------
	//1時刻目と2時刻目のPIを接続するDFF
	//---------------------------------------------
	n = n + n_pi * 2;

	//戻り値：制約数
	return n;
}