//------------------------------------------------------------------------
//インクルード
//------------------------------------------------------------------------
#include <stdio.h>
#include <time.h>
#include<stdlib.h>
#include<string.h>

//------------------------------------------------------------------------
//自作インクルード
//------------------------------------------------------------------------
#include"../Header/Define.h"

//===================================================
//関数名:check_open_pass
//機能:オープンパスのチェック
//戻り値：int 正常終了:SUCCESS(=0) , 異常終了:ERROR(=-1)
//引数：なし
//===================================================
int check_open_pass(void) {
	int i;
	NLIST *p;

	//FFより到達可能な信号線の探索
	for (i = 0; i < n_dff; i++) { open_push(dff[i]); }
	while (Open.ptr != 0) {
		p = open_pop();
		if (p->open_pass == YES) {
			p->open_pass = NO;	//オープンパスでない
			p->fault_pass = YES;//オープンパスでない
			if (p->n_out != 0 && p->ppo_flag != 1) {
				for (i = 0; i < p->n_out; i++) { open_push(p->out[i]); }
			}
		}
	}
	return SUCCESS;
}