//------------------------------------------------------------------------
//インクルード
//------------------------------------------------------------------------
#include <stdio.h>
#include <time.h>
#include<stdlib.h>
#include<string.h>

//------------------------------------------------------------------------
//自作インクルード
//------------------------------------------------------------------------
#include"../Header/Define.h"

//===================================================
//関数名:open_push
//機能:プッシュ(オープンパス)
//戻り値：なし
//引数：信号線
//===================================================
void open_push(NLIST* p) {
	int	i;

	if (Open.ptr >= Open.max_num) {
		printf("stack overflow(Open_stack.c)\n");
		exit(1);
	}
	i = Open.ptr;
	Open.stk[i] = p;
	Open.ptr++;
}

//=========================================================================
//  関数名 : open_pop
//  機  能 : ポップ(オープンパス)
//  戻り値 : 信号線
//  引  数 : なし
//=========================================================================
NLIST* open_pop(void) {
	int	i;

	if (Open.ptr < 1) {
		printf("stack underflow(Open_stack.c)\n");
		exit(1);
	}
	i = Open.ptr - 1;
	Open.ptr--;
	return Open.stk[i];
}
