//------------------------------------------------------------------------
//インクルード
//------------------------------------------------------------------------
#include <stdio.h>
#include <time.h>
#include<stdlib.h>
#include<string.h>

//------------------------------------------------------------------------
//自作インクルード
//------------------------------------------------------------------------
#include"../../Header/Define.h"

//=========================================================================
//  関数名 : make_test_set
//  機  能 : テスト集合に追加
//  戻り値 : なし
//  引  数 : ファイルポインタ
//=========================================================================
void make_test_set(FILE *fp_ts) {

	char str[50000];
	FILE*fp;

	if ((fp=fopen("tv.txt", "r")) == NULL) {
		printf("【ERROR】:File open tv.txt(make_test_set.c)\n");
		exit(1);
	}

	while (fgets(str, 50000, fp) != NULL) {
		if ((strcmp(str, "\n")) != 0) {
			fprintf(fp_ts, "%s", str);
		}
	}

	fclose(fp);

}