//------------------------------------------------------------------------
//インクルード
//------------------------------------------------------------------------
#include <stdio.h>
#include <time.h>
#include<stdlib.h>
#include<string.h>

//------------------------------------------------------------------------
//自作インクルード
//------------------------------------------------------------------------
#include"../../Header/Define.h"

//===================================================
//関数名:level_push
//機能:プッシュ(レベライズ)
//戻り値：なし
//引数：信号線
//===================================================
void level_push(NLIST* p) {
	int	i;

	if (Level.ptr >= Level.max_num) {
		printf("stack overflow(Level_stack.c)\n");
		exit(1);
	}
	i = Level.ptr;
	Level.stk[i] = p;
	Level.ptr++;
}

//=========================================================================
//  関数名 : level_pop
//  機  能 : ポップ(レベライズ)
//  戻り値 : 信号線
//  引  数 : なし
//=========================================================================
NLIST* level_pop(void) {
	int	i;

	if (Level.ptr < 1) {
		printf("stack underflow(Level_stack.c)\n");
		exit(1);
	}
	i = Level.ptr - 1;
	Level.ptr--;
	return Level.stk[i];
}